bigbass1997/PICTAS/firmware/viz/p18lf45k50.inc
_CP3_ON_5L           EQU  H'F7'; Block 3 is code-protected
_CP3_OFF_5L          EQU  H'FF'; Block 3 is not code-protected

;----- CONFIG5H Options --------------------------------------------------
_CPB_ON_5H           EQU  H'BF'; Boot block is code-protected
_CPB_OFF_5H          EQU  H'FF'; Boot block is not code-protected

_CPD_ON_5H           EQU  H'7F'; Data EEPROM is code-protected
_CPD_OFF_5H          EQU  H'FF'; Data EEPROM is not code-protected

;----- CONFIG6L Options --------------------------------------------------
_WRT0_ON_6L          EQU  H'FE'; Block 0 (0800-1FFFh) is write-protected
_WRT0_OFF_6L         EQU  H'FF'; Block 0 (0800-1FFFh) is not write-protected

_WRT1_ON_6L          EQU  H'FD'; Block 1 (2000-3FFFh) is write-protected
_WRT1_OFF_6L         EQU  H'FF'; Block 1 (2000-3FFFh) is not write-protected

_WRT2_ON_6L          EQU  H'FB'; Block 2 (04000-5FFFh) is write-protected
_WRT2_OFF_6L         EQU  H'FF'; Block 2 (04000-5FFFh) is not write-protected

_WRT3_ON_6L          EQU  H'F7'; Block 3 (06000-7FFFh) is write-protected
_WRT3_OFF_6L         EQU  H'FF'; Block 3 (06000-7FFFh) is not write-protected

;----- CONFIG6H Options --------------------------------------------------
_WRTC_ON_6H          EQU  H'DF'; Configuration registers (300000-3000FFh) are write-protected
_WRTC_OFF_6H         EQU  H'FF'; Configuration registers (300000-3000FFh) are not write-protected

_WRTB_ON_6H          EQU  H'BF'; Boot block (0000-7FFh) is write-protected
_WRTB_OFF_6H         EQU  H'FF'; Boot block (0000-7FFh) is not write-protected

_WRTD_ON_6H          EQU  H'7F'; Data EEPROM is write-protected
_WRTD_OFF_6H         EQU  H'FF'; Data EEPROM is not write-protected

;----- CONFIG7L Options --------------------------------------------------
_EBTR0_ON_7L         EQU  H'FE'; Block 0 is protected from table reads executed in other blocks
_EBTR0_OFF_7L        EQU  H'FF'; Block 0 is not protected from table reads executed in other blocks

_EBTR1_ON_7L         EQU  H'FD'; Block 1 is protected from table reads executed in other blocks
_EBTR1_OFF_7L        EQU  H'FF'; Block 1 is not protected from table reads executed in other blocks

_EBTR2_ON_7L         EQU  H'FB'; Block 2 is protected from table reads executed in other blocks
_EBTR2_OFF_7L        EQU  H'FF'; Block 2 is not protected from table reads executed in other blocks

_EBTR3_ON_7L         EQU  H'F7'; Block 3 is protected from table reads executed in other blocks
_EBTR3_OFF_7L        EQU  H'FF'; Block 3 is not protected from table reads executed in other blocks

;----- CONFIG7H Options --------------------------------------------------
_EBTRB_ON_7H         EQU  H'BF'; Boot block is protected from table reads executed in other blocks
_EBTRB_OFF_7H        EQU  H'FF'; Boot block is not protected from table reads executed in other blocks


;----- DEVID Equates --------------------------------------------------
_DEVID1          EQU  H'3FFFFE'
_DEVID2          EQU  H'3FFFFF'

;----- IDLOC Equates --------------------------------------------------
_IDLOC0          EQU  H'200000'
_IDLOC1          EQU  H'200001'
_IDLOC2          EQU  H'200002'
_IDLOC3          EQU  H'200003'
_IDLOC4          EQU  H'200004'
_IDLOC5          EQU  H'200005'
_IDLOC6          EQU  H'200006'
_IDLOC7          EQU  H'200007'

        LIST
